{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "input_dtype": "float32", "sparse": false, "name": "input_4"}, "inbound_nodes": [], "name": "input_4"}, {"class_name": "ZeroPadding2D", "config": {"padding": [3, 3], "trainable": true, "name": "zeropadding2d_2"}, "inbound_nodes": [[["input_4", 0, 0]]], "name": "zeropadding2d_2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 7, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 7}, "inbound_nodes": [[["zeropadding2d_2", 0, 0]]], "name": "conv1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn_conv1", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["conv1", 0, 0]]], "name": "bn_conv1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_50"}, "inbound_nodes": [[["bn_conv1", 0, 0]]], "name": "activation_50"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "dim_ordering": "tf", "pool_size": [3, 3], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["activation_50", 0, 0]]], "name": "maxpooling2d_2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res2a_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "name": "res2a_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2a_branch2a", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res2a_branch2a", 0, 0]]], "name": "bn2a_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_51"}, "inbound_nodes": [[["bn2a_branch2a", 0, 0]]], "name": "activation_51"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res2a_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_51", 0, 0]]], "name": "res2a_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2a_branch2b", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res2a_branch2b", 0, 0]]], "name": "bn2a_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_52"}, "inbound_nodes": [[["bn2a_branch2b", 0, 0]]], "name": "activation_52"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res2a_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_52", 0, 0]]], "name": "res2a_branch2c"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res2a_branch1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "name": "res2a_branch1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2a_branch2c", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res2a_branch2c", 0, 0]]], "name": "bn2a_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2a_branch1", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res2a_branch1", 0, 0]]], "name": "bn2a_branch1"}, {"class_name": "Merge", "config": {"name": "merge_17", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn2a_branch2c", 0, 0], ["bn2a_branch1", 0, 0]]], "name": "merge_17"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_53"}, "inbound_nodes": [[["merge_17", 0, 0]]], "name": "activation_53"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res2b_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_53", 0, 0]]], "name": "res2b_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2b_branch2a", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res2b_branch2a", 0, 0]]], "name": "bn2b_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_54"}, "inbound_nodes": [[["bn2b_branch2a", 0, 0]]], "name": "activation_54"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res2b_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_54", 0, 0]]], "name": "res2b_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2b_branch2b", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res2b_branch2b", 0, 0]]], "name": "bn2b_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_55"}, "inbound_nodes": [[["bn2b_branch2b", 0, 0]]], "name": "activation_55"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res2b_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_55", 0, 0]]], "name": "res2b_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2b_branch2c", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res2b_branch2c", 0, 0]]], "name": "bn2b_branch2c"}, {"class_name": "Merge", "config": {"name": "merge_18", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn2b_branch2c", 0, 0], ["activation_53", 0, 0]]], "name": "merge_18"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_56"}, "inbound_nodes": [[["merge_18", 0, 0]]], "name": "activation_56"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res2c_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_56", 0, 0]]], "name": "res2c_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2c_branch2a", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res2c_branch2a", 0, 0]]], "name": "bn2c_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_57"}, "inbound_nodes": [[["bn2c_branch2a", 0, 0]]], "name": "activation_57"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res2c_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_57", 0, 0]]], "name": "res2c_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2c_branch2b", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res2c_branch2b", 0, 0]]], "name": "bn2c_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_58"}, "inbound_nodes": [[["bn2c_branch2b", 0, 0]]], "name": "activation_58"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res2c_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_58", 0, 0]]], "name": "res2c_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn2c_branch2c", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res2c_branch2c", 0, 0]]], "name": "bn2c_branch2c"}, {"class_name": "Merge", "config": {"name": "merge_19", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn2c_branch2c", 0, 0], ["activation_56", 0, 0]]], "name": "merge_19"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_59"}, "inbound_nodes": [[["merge_19", 0, 0]]], "name": "activation_59"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res3a_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_59", 0, 0]]], "name": "res3a_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn3a_branch2a", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res3a_branch2a", 0, 0]]], "name": "bn3a_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_60"}, "inbound_nodes": [[["bn3a_branch2a", 0, 0]]], "name": "activation_60"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res3a_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_60", 0, 0]]], "name": "res3a_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn3a_branch2b", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res3a_branch2b", 0, 0]]], "name": "bn3a_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_61"}, "inbound_nodes": [[["bn3a_branch2b", 0, 0]]], "name": "activation_61"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res3a_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_61", 0, 0]]], "name": "res3a_branch2c"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res3a_branch1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_59", 0, 0]]], "name": "res3a_branch1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn3a_branch2c", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res3a_branch2c", 0, 0]]], "name": "bn3a_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn3a_branch1", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res3a_branch1", 0, 0]]], "name": "bn3a_branch1"}, {"class_name": "Merge", "config": {"name": "merge_20", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn3a_branch2c", 0, 0], ["bn3a_branch1", 0, 0]]], "name": "merge_20"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_62"}, "inbound_nodes": [[["merge_20", 0, 0]]], "name": "activation_62"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res3b_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_62", 0, 0]]], "name": "res3b_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn3b_branch2a", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res3b_branch2a", 0, 0]]], "name": "bn3b_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_63"}, "inbound_nodes": [[["bn3b_branch2a", 0, 0]]], "name": "activation_63"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res3b_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_63", 0, 0]]], "name": "res3b_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn3b_branch2b", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res3b_branch2b", 0, 0]]], "name": "bn3b_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_64"}, "inbound_nodes": [[["bn3b_branch2b", 0, 0]]], "name": "activation_64"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res3b_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_64", 0, 0]]], "name": "res3b_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn3b_branch2c", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res3b_branch2c", 0, 0]]], "name": "bn3b_branch2c"}, {"class_name": "Merge", "config": {"name": "merge_21", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn3b_branch2c", 0, 0], ["activation_62", 0, 0]]], "name": "merge_21"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_65"}, "inbound_nodes": [[["merge_21", 0, 0]]], "name": "activation_65"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res3c_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_65", 0, 0]]], "name": "res3c_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn3c_branch2a", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res3c_branch2a", 0, 0]]], "name": "bn3c_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_66"}, "inbound_nodes": [[["bn3c_branch2a", 0, 0]]], "name": "activation_66"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res3c_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_66", 0, 0]]], "name": "res3c_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn3c_branch2b", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res3c_branch2b", 0, 0]]], "name": "bn3c_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_67"}, "inbound_nodes": [[["bn3c_branch2b", 0, 0]]], "name": "activation_67"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res3c_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_67", 0, 0]]], "name": "res3c_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn3c_branch2c", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res3c_branch2c", 0, 0]]], "name": "bn3c_branch2c"}, {"class_name": "Merge", "config": {"name": "merge_22", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn3c_branch2c", 0, 0], ["activation_65", 0, 0]]], "name": "merge_22"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_68"}, "inbound_nodes": [[["merge_22", 0, 0]]], "name": "activation_68"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res3d_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_68", 0, 0]]], "name": "res3d_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn3d_branch2a", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res3d_branch2a", 0, 0]]], "name": "bn3d_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_69"}, "inbound_nodes": [[["bn3d_branch2a", 0, 0]]], "name": "activation_69"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res3d_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_69", 0, 0]]], "name": "res3d_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn3d_branch2b", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res3d_branch2b", 0, 0]]], "name": "bn3d_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_70"}, "inbound_nodes": [[["bn3d_branch2b", 0, 0]]], "name": "activation_70"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res3d_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_70", 0, 0]]], "name": "res3d_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn3d_branch2c", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res3d_branch2c", 0, 0]]], "name": "bn3d_branch2c"}, {"class_name": "Merge", "config": {"name": "merge_23", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn3d_branch2c", 0, 0], ["activation_68", 0, 0]]], "name": "merge_23"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_71"}, "inbound_nodes": [[["merge_23", 0, 0]]], "name": "activation_71"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4a_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_71", 0, 0]]], "name": "res4a_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4a_branch2a", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4a_branch2a", 0, 0]]], "name": "bn4a_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_72"}, "inbound_nodes": [[["bn4a_branch2a", 0, 0]]], "name": "activation_72"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4a_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_72", 0, 0]]], "name": "res4a_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4a_branch2b", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4a_branch2b", 0, 0]]], "name": "bn4a_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_73"}, "inbound_nodes": [[["bn4a_branch2b", 0, 0]]], "name": "activation_73"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4a_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1024, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_73", 0, 0]]], "name": "res4a_branch2c"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4a_branch1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 1024, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_71", 0, 0]]], "name": "res4a_branch1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4a_branch2c", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4a_branch2c", 0, 0]]], "name": "bn4a_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4a_branch1", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4a_branch1", 0, 0]]], "name": "bn4a_branch1"}, {"class_name": "Merge", "config": {"name": "merge_24", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn4a_branch2c", 0, 0], ["bn4a_branch1", 0, 0]]], "name": "merge_24"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_74"}, "inbound_nodes": [[["merge_24", 0, 0]]], "name": "activation_74"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4b_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_74", 0, 0]]], "name": "res4b_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4b_branch2a", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4b_branch2a", 0, 0]]], "name": "bn4b_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_75"}, "inbound_nodes": [[["bn4b_branch2a", 0, 0]]], "name": "activation_75"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4b_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_75", 0, 0]]], "name": "res4b_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4b_branch2b", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4b_branch2b", 0, 0]]], "name": "bn4b_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_76"}, "inbound_nodes": [[["bn4b_branch2b", 0, 0]]], "name": "activation_76"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4b_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1024, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_76", 0, 0]]], "name": "res4b_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4b_branch2c", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4b_branch2c", 0, 0]]], "name": "bn4b_branch2c"}, {"class_name": "Merge", "config": {"name": "merge_25", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn4b_branch2c", 0, 0], ["activation_74", 0, 0]]], "name": "merge_25"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_77"}, "inbound_nodes": [[["merge_25", 0, 0]]], "name": "activation_77"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4c_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_77", 0, 0]]], "name": "res4c_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4c_branch2a", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4c_branch2a", 0, 0]]], "name": "bn4c_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_78"}, "inbound_nodes": [[["bn4c_branch2a", 0, 0]]], "name": "activation_78"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4c_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_78", 0, 0]]], "name": "res4c_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4c_branch2b", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4c_branch2b", 0, 0]]], "name": "bn4c_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_79"}, "inbound_nodes": [[["bn4c_branch2b", 0, 0]]], "name": "activation_79"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4c_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1024, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_79", 0, 0]]], "name": "res4c_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4c_branch2c", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4c_branch2c", 0, 0]]], "name": "bn4c_branch2c"}, {"class_name": "Merge", "config": {"name": "merge_26", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn4c_branch2c", 0, 0], ["activation_77", 0, 0]]], "name": "merge_26"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_80"}, "inbound_nodes": [[["merge_26", 0, 0]]], "name": "activation_80"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4d_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_80", 0, 0]]], "name": "res4d_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4d_branch2a", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4d_branch2a", 0, 0]]], "name": "bn4d_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_81"}, "inbound_nodes": [[["bn4d_branch2a", 0, 0]]], "name": "activation_81"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4d_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_81", 0, 0]]], "name": "res4d_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4d_branch2b", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4d_branch2b", 0, 0]]], "name": "bn4d_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_82"}, "inbound_nodes": [[["bn4d_branch2b", 0, 0]]], "name": "activation_82"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4d_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1024, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_82", 0, 0]]], "name": "res4d_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4d_branch2c", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4d_branch2c", 0, 0]]], "name": "bn4d_branch2c"}, {"class_name": "Merge", "config": {"name": "merge_27", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn4d_branch2c", 0, 0], ["activation_80", 0, 0]]], "name": "merge_27"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_83"}, "inbound_nodes": [[["merge_27", 0, 0]]], "name": "activation_83"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4e_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_83", 0, 0]]], "name": "res4e_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4e_branch2a", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4e_branch2a", 0, 0]]], "name": "bn4e_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_84"}, "inbound_nodes": [[["bn4e_branch2a", 0, 0]]], "name": "activation_84"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4e_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_84", 0, 0]]], "name": "res4e_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4e_branch2b", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4e_branch2b", 0, 0]]], "name": "bn4e_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_85"}, "inbound_nodes": [[["bn4e_branch2b", 0, 0]]], "name": "activation_85"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4e_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1024, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_85", 0, 0]]], "name": "res4e_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4e_branch2c", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4e_branch2c", 0, 0]]], "name": "bn4e_branch2c"}, {"class_name": "Merge", "config": {"name": "merge_28", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn4e_branch2c", 0, 0], ["activation_83", 0, 0]]], "name": "merge_28"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_86"}, "inbound_nodes": [[["merge_28", 0, 0]]], "name": "activation_86"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4f_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_86", 0, 0]]], "name": "res4f_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4f_branch2a", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4f_branch2a", 0, 0]]], "name": "bn4f_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_87"}, "inbound_nodes": [[["bn4f_branch2a", 0, 0]]], "name": "activation_87"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4f_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_87", 0, 0]]], "name": "res4f_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4f_branch2b", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4f_branch2b", 0, 0]]], "name": "bn4f_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_88"}, "inbound_nodes": [[["bn4f_branch2b", 0, 0]]], "name": "activation_88"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res4f_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1024, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_88", 0, 0]]], "name": "res4f_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn4f_branch2c", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res4f_branch2c", 0, 0]]], "name": "bn4f_branch2c"}, {"class_name": "Merge", "config": {"name": "merge_29", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn4f_branch2c", 0, 0], ["activation_86", 0, 0]]], "name": "merge_29"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_89"}, "inbound_nodes": [[["merge_29", 0, 0]]], "name": "activation_89"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res5a_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_89", 0, 0]]], "name": "res5a_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn5a_branch2a", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res5a_branch2a", 0, 0]]], "name": "bn5a_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_90"}, "inbound_nodes": [[["bn5a_branch2a", 0, 0]]], "name": "activation_90"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res5a_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_90", 0, 0]]], "name": "res5a_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn5a_branch2b", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res5a_branch2b", 0, 0]]], "name": "bn5a_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_91"}, "inbound_nodes": [[["bn5a_branch2b", 0, 0]]], "name": "activation_91"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res5a_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 2048, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_91", 0, 0]]], "name": "res5a_branch2c"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res5a_branch1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 2048, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_89", 0, 0]]], "name": "res5a_branch1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn5a_branch2c", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res5a_branch2c", 0, 0]]], "name": "bn5a_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn5a_branch1", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res5a_branch1", 0, 0]]], "name": "bn5a_branch1"}, {"class_name": "Merge", "config": {"name": "merge_30", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["bn5a_branch2c", 0, 0], ["bn5a_branch1", 0, 0]]], "name": "merge_30"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_92"}, "inbound_nodes": [[["merge_30", 0, 0]]], "name": "activation_92"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res5b_branch2a", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_92", 0, 0]]], "name": "res5b_branch2a"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn5b_branch2a", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res5b_branch2a", 0, 0]]], "name": "bn5b_branch2a"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_93"}, "inbound_nodes": [[["bn5b_branch2a", 0, 0]]], "name": "activation_93"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res5b_branch2b", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_93", 0, 0]]], "name": "res5b_branch2b"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn5b_branch2b", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res5b_branch2b", 0, 0]]], "name": "bn5b_branch2b"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_94"}, "inbound_nodes": [[["bn5b_branch2b", 0, 0]]], "name": "activation_94"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "res5b_branch2c", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 2048, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_94", 0, 0]]], "name": "res5b_branch2c"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "bn5b_branch2c", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "inbound_nodes": [[["res5b_branch2c", 0, 0]]], "name": "bn5b_branch2c"}, {"class_name": "Merge", "config": {"name": 